Autodesk.Revit.DB.TagHeadPositionOptions
An enumerated type listing the tag-head position options supported by the Bending Detail.

Autodesk.Revit.DB.TagHeadPositionOptions.Center
The tag-head position is at the center of the Bending Detial.

Autodesk.Revit.DB.TagHeadPositionOptions.Left
The tag-head position is at the left of the Bending Detial.

Autodesk.Revit.DB.TagHeadPositionOptions.Right
The tag-head position is at the right of the Bending Detial.

Autodesk.Revit.DB.TagHeadPositionOptions.Bottom
The tag-head position is at the bottom of the Bending Detial.

Autodesk.Revit.DB.TagHeadPositionOptions.Top
The tag-head position is at the top of the Bending Detial.